In [3]:
# pandas:
# it is used to perform data analysis and manipulation
# why pandas ?
# we can work on tabluer data : the data which is having rows and columns

In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd

In [6]:
# Series : series is a one dimentional labelled arrays

In [7]:
lst = ['html', 'css', 'java', 'python', 'bootstrap']

In [8]:
ser = pd.Series(lst)

In [9]:
ser

0         html
1          css
2         java
3       python
4    bootstrap
dtype: object

In [10]:
type(ser)

pandas.core.series.Series

In [11]:
ser

0         html
1          css
2         java
3       python
4    bootstrap
dtype: object

In [12]:
ser[2]

'java'

In [13]:
ser[3]

'python'

In [14]:
ser.index = ['A', 'B', "C", 'D', 'E']

In [15]:
ser

A         html
B          css
C         java
D       python
E    bootstrap
dtype: object

In [16]:
ser

A         html
B          css
C         java
D       python
E    bootstrap
dtype: object

In [17]:
ser['A']

'html'

In [18]:
ser[0]

C:\Users\DELL\AppData\Local\Temp\ipykernel_26032\2519058933.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0]

'html'

In [19]:
# Data frame :  two dimentional labelled arrys
# when we combine two or more than two series it will form data frame

In [20]:
import numpy as np

In [21]:
arr = np.random.randint(1,100, (8,6))

In [22]:
arr

array([[76, 23,  6, 25, 98, 39],
       [ 6, 29, 58, 85, 44, 66],
       [ 2, 70, 14, 57, 38, 17],
       [94, 42, 94, 74, 40, 66],
       [53, 38, 84, 39, 84, 73],
       [ 7,  3, 79, 18, 36, 30],
       [92, 48,  7,  7, 18,  7],
       [ 9, 68, 64, 54, 66, 23]])

In [23]:
df = pd.DataFrame(arr)

In [24]:
df

    0   1   2   3   4   5
0  76  23   6  25  98  39
1   6  29  58  85  44  66
2   2  70  14  57  38  17
3  94  42  94  74  40  66
4  53  38  84  39  84  73
5   7   3  79  18  36  30
6  92  48   7   7  18   7
7   9  68  64  54  66  23

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [27]:
df.columns

RangeIndex(start=0, stop=6, step=1)

In [28]:
df.shape

(8, 6)

In [29]:
df.dtypes

0    int32
1    int32
2    int32
3    int32
4    int32
5    int32
dtype: object

In [30]:
df

    0   1   2   3   4   5
0  76  23   6  25  98  39
1   6  29  58  85  44  66
2   2  70  14  57  38  17
3  94  42  94  74  40  66
4  53  38  84  39  84  73
5   7   3  79  18  36  30
6  92  48   7   7  18   7
7   9  68  64  54  66  23

In [41]:
df[2]

0     4
1     3
2    43
3    53
4    14
5    68
6    29
7    63
Name: 2, dtype: int32

In [43]:
df[1]

0     4
1     6
2    48
3    17
4    15
5    48
6    81
7    57
Name: 1, dtype: int32

In [45]:
df[3]

0    75
1    74
2    52
3    36
4    47
5    87
6    54
7    83
Name: 3, dtype: int32

In [47]:
df[1]

0     4
1     6
2    48
3    17
4    15
5    48
6    81
7    57
Name: 1, dtype: int32

In [50]:
df.columns = "a b c d e f".split()

In [51]:
df

    a   b   c   d   e   f
0  93   4   4  75  39   7
1   6   6   3  74  75   2
2  59  48  43  52  57  99
3  25  17  53  36  81  88
4  99  15  14  47  10   7
5  20  48  68  87  23  70
6  55  81  29  54  48  43
7  92  57  63  83  24  50

In [52]:
df.index = 'p q r s t u v w'.split()

In [53]:
df

    a   b   c   d   e   f
p  93   4   4  75  39   7
q   6   6   3  74  75   2
r  59  48  43  52  57  99
s  25  17  53  36  81  88
t  99  15  14  47  10   7
u  20  48  68  87  23  70
v  55  81  29  54  48  43
w  92  57  63  83  24  50

In [55]:
df['d']

p    75
q    74
r    52
s    36
t    47
u    87
v    54
w    83
Name: d, dtype: int32

In [1]:
df['p']

NameError: name 'df' is not defined

In [59]:
df

    a   b   c   d   e   f
p  93   4   4  75  39   7
q   6   6   3  74  75   2
r  59  48  43  52  57  99
s  25  17  53  36  81  88
t  99  15  14  47  10   7
u  20  48  68  87  23  70
v  55  81  29  54  48  43
w  92  57  63  83  24  50

In [60]:
# loc : location
# iloc  : interger location

In [62]:
df.loc['q']

a     6
b     6
c     3
d    74
e    75
f     2
Name: q, dtype: int32

In [64]:
df.loc['s']

a    25
b    17
c    53
d    36
e    81
f    88
Name: s, dtype: int32

In [67]:
df.iloc[4]

a    99
b    15
c    14
d    47
e    10
f     7
Name: t, dtype: int32

In [69]:
df.loc['t']

a    99
b    15
c    14
d    47
e    10
f     7
Name: t, dtype: int32

In [71]:
df['e']

p    39
q    75
r    57
s    81
t    10
u    23
v    48
w    24
Name: e, dtype: int32

In [73]:
df.loc['u']

a    20
b    48
c    68
d    87
e    23
f    70
Name: u, dtype: int32

<h1>------------------------------------pandas-----------------------------------------</h1>

In [1]:
import numpy as np
import pandas as pd

In [5]:
data=np.arange(1,21).reshape(4,5)
data

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20]])

In [6]:
#create DATAFRAME-------------------------> 
df=pd.DataFrame(data,index=["row1","row2","row3","row4"],columns=["col1","col2","col3","col4","col5"])

In [7]:
df

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     7     8     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [8]:
df.head()# -------------->top 5 record

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     7     8     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [11]:
df.tail() #------------> last 5 record

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     7     8     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [10]:
df.head(2)

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     7     8     9    10

In [12]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.info()#----->datatype of dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int32
 1   col2    4 non-null      int32
 2   col3    4 non-null      int32
 3   col4    4 non-null      int32
 4   col5    4 non-null      int32
dtypes: int32(5)
memory usage: 112.0+ bytes

In [15]:
df.describe()

            col1       col2       col3       col4       col5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    8.500000   9.500000  10.500000  11.500000  12.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     1.000000   2.000000   3.000000   4.000000   5.000000
25%     4.750000   5.750000   6.750000   7.750000   8.750000
50%     8.500000   9.500000  10.500000  11.500000  12.500000
75%    12.250000  13.250000  14.250000  15.250000  16.250000
max    16.000000  17.000000  18.000000  19.000000  20.000000

In [16]:
#indexing------------------>
##coulumn, rowindex[loc],column_index number[.iloc]

In [17]:
df

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     7     8     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [27]:
#by using column names
df[['col1','col2','col3']]

      col1  col2  col3
row1     1     2     3
row2     6     7     8
row3    11    12    13
row4    16    17    18

In [29]:
type(df['col1'])

pandas.core.series.Series

In [32]:
#by using row index names by loc 
df.loc[['row3','row4']]

      col1  col2  col3  col4  col5
row3    11    12    13    14    15
row4    16    17    18    19    20

In [35]:

df.iloc[3]

col1    16
col2    17
col3    18
col4    19
col5    20
Name: row4, dtype: int32

In [37]:
df.head()

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     7     8     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [39]:
df.iloc[2:4,1:3]

      col2  col3
row3    12    13
row4    17    18

In [43]:
df.iloc[-3:-1,-2:]

      col4  col5
row2     9    10
row3    14    15

In [45]:
df.iloc[1:3,1:3]

      col2  col3
row2     7     8
row3    12    13

In [46]:
df.head()

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     7     8     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [52]:
df[['col1','col5']]

      col1  col5
row1     1     5
row2     6    10
row3    11    15
row4    16    20

In [55]:
#convert dataframe into arrays 
df.iloc[:,1:].values

array([[ 2,  3,  4,  5],
       [ 7,  8,  9, 10],
       [12, 13, 14, 15],
       [17, 18, 19, 20]])

In [56]:
###operations

In [57]:
df

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     7     8     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [59]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

In [86]:
df.iloc[1][1:3]=np.nan

In [87]:
df

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     0     0     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [88]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

In [75]:

dg=pd.DataFrame(data=[[3,np.nan,3],[3,5,6],[4,5,6]],index=["row1","row2","row3"],columns=["col1","col2","col3"])

In [76]:
dg

      col1  col2  col3
row1     3   NaN     3
row2     3   5.0     6
row3     4   5.0     6

In [89]:
dg.isnull().sum()

col1    0
col2    1
col3    0
dtype: int64

In [90]:
df

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     0     0     9    10
row3    11    12    13    14    15
row4    16    17    18    19    20

In [91]:
df['col3'].unique()

array([ 3,  0, 13, 18])

In [92]:
df['col3'].value_counts()

col3
3     1
0     1
13    1
18    1
Name: count, dtype: int64

In [98]:
df[df['col2']<12]

      col1  col2  col3  col4  col5
row1     1     2     3     4     5
row2     6     0     0     9    10

In [105]:
df[df['col4']>10]

      col1  col2  col3  col4  col5
row3    11    12    13    14    15
row4    16    17    18    19    20

In [107]:
#reading different data source with the help of pandas

In [5]:
import pandas as pd

In [9]:
gh=pd.read_csv('mercedesbenz.csv')
gh

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4207,8415,87.48,al,r,e,f,d,aa,l,u,...,0,0,0,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [16]:
#import pandas as pd

# Specify the full file path
df=pd.read_csv('C:\\Users\\DELL\\Downloads\\mercedesbenz.csv')

# Read the CSV file
df = pd.read_csv(file_path)

In [2]:
df

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4207,8415,87.48,al,r,e,f,d,aa,l,u,...,0,0,0,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [21]:
df=pd.read_csv('C:\\Users\\DELL\\Downloads\\mercedesbenz.csv')
df

In [24]:
gf=pd.read_csv('mercedesbenz.csv')
gf.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [25]:
df

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4207,8415,87.48,al,r,e,f,d,aa,l,u,...,0,0,0,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [40]:
from io import StringIO

In [52]:
data=('col1,col2,col3,col4\n'
     'x,y,z\n'
     '1,2,3\n'
     '4,5,6\n')

In [53]:
type(data)

str

In [54]:
#in memory file format object
StringIO(data)

In [55]:
pd.read_csv(StringIO(data))

  col1 col2 col3  col4
0    x    y    z   NaN
1    1    2    3   NaN
2    4    5    6   NaN

In [56]:
pd.read_csv(StringIO(data),usecols=['col1','col2'])

  col1 col2
0    x    y
1    1    2
2    4    5

In [57]:
df

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4207,8415,87.48,al,r,e,f,d,aa,l,u,...,0,0,0,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [63]:
cd=pd.read_csv('mercedesbenz.csv',usecols=['X0','X1','X2','X3','X4','X5'])
cd.head()

   X0 X1  X2 X3 X4 X5
0   k  v  at  a  d  u
1   k  t  av  e  d  y
2  az  w   n  c  d  x
3  az  t   n  f  d  x
4  az  v   n  f  d  h

In [66]:
cd.isnull().head().sum()

X0    0
X1    0
X2    0
X3    0
X4    0
X5    0
dtype: int64

In [67]:
cd

      X0 X1  X2 X3 X4  X5
0      k  v  at  a  d   u
1      k  t  av  e  d   y
2     az  w   n  c  d   x
3     az  t   n  f  d   x
4     az  v   n  f  d   h
...   .. ..  .. .. ..  ..
4204  ak  s  as  c  d  aa
4205   j  o   t  d  d  aa
4206  ak  v   r  a  d  aa
4207  al  r   e  f  d  aa
4208   z  r  ae  c  d  aa

[4209 rows x 6 columns]

In [70]:
cd.to_csv('test.csv',index=False)

In [71]:
#datatypes in csv
data=('a,d,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11\n')

In [74]:
df=pd.read_csv(StringIO(data))

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   d       3 non-null      int64
 2   c       3 non-null      int64
 3   d.1     2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [76]:
df=pd.read_csv(StringIO(data),dtype='object')

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   d       3 non-null      object
 2   c       3 non-null      object
 3   d.1     2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [78]:
df

   a   d   c  d.1
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [111]:

df.columns= "a b c d".split()
df

   a   b     c    d
a  1   2   3.0  4.0
b  5   6   7.0  8.0
c  9  10  11.0  NaN

In [103]:
df.isnull().sum()

a      0
d      0
c      0
d.1    1
dtype: int64

In [82]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [83]:
df['a'][0]

'1'

In [94]:
data=('a,d,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11')

In [113]:
df=pd.read_csv(StringIO(data),dtype={'a':'int','b':'float','c':'float'})

In [96]:
type(data)

str

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   d       3 non-null      int64
 2   c       3 non-null      float64
 3   d.1     2 non-null      float64
dtypes: float64(2), int32(1), int64(1)
memory usage: 216.0 bytes

In [117]:

df.columns='a b c d'.split()
df

   a   b     c    d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [123]:
df.dtype=({'a':'float'})
# df.info

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      int64
 2   c       3 non-null      float64
 3   d       2 non-null      float64
dtypes: float64(2), int32(1), int64(1)
memory usage: 216.0 bytes

In [128]:
df=pd.read_csv(StringIO(data),dtype={'a':'int','d':'float','c':'float'})

In [126]:
df

   a   d     c  d.1
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   d       3 non-null      float64
 2   c       3 non-null      float64
 3   d.1     2 non-null      float64
dtypes: float64(3), int32(1)
memory usage: 216.0 bytes

In [139]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   d       3 non-null      float64
 2   c       3 non-null      float64
 3   d.1     2 non-null      float64
dtypes: float64(3), int32(1)
memory usage: 216.0 bytes

In [141]:
data=('index,a,b,c\n'
     '4,apple,bat,5.7\n'
     '8,orange,cow,10')

In [145]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [148]:
#use index cols and usecols
data=(',a,b,c\n'
     '4,apple,bat,5.7\n'
     '8,orange,cow,10')

In [156]:
pd.read_csv(StringIO(data),usecols=['a','b','c'],index_col=0)

          b     c
a
apple   bat   5.7
orange  cow  10.0

In [158]:
pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='/t').to_csv('filed')

C:\Users\DELL\AppData\Local\Temp\ipykernel_9956\1201754299.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='/t').to_csv('filed')

HTTPError: HTTP Error 403: Forbidden

<h1>Working with json</h1>

In [2]:
import pandas as pd
df=pd.read_json('simple.json')
df

       name  age grade
0     Andew   12     A
1    Bhuvan   18     B
2   Clinton   11     A
3     Drake   12     C
4     Eisha   13     B
5    Farhan   22     C
6    Garima   11     A
7  Himanshu   19     A
8    Ishaan   10     D
9     Jason    9     B

In [16]:
df[['name','grade']]

       name grade
0     Andew     A
1    Bhuvan     B
2   Clinton     A
3     Drake     C
4     Eisha     B
5    Farhan     C
6    Garima     A
7  Himanshu     A
8    Ishaan     D
9     Jason     B

In [19]:
#add in column
cities=['a','b','c','d','e','f','g','h','i','j']
df['city']=cities
df.to_csv('index')

In [21]:
cv=pd.read_csv('index')

In [23]:
cv.head()

   Unnamed: 0     name  age grade city
0           0    Andew   12     A    a
1           1   Bhuvan   18     B    b
2           2  Clinton   11     A    c
3           3    Drake   12     C    d
4           4    Eisha   13     B    e

In [24]:
cv['grade'].unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [25]:
cv['grade'].value_counts()

grade
A    4
B    3
C    2
D    1
Name: count, dtype: int64

In [12]:
import pandas as pd

# Specify the full file path
# file_path = 'C:\\Users\\DELL\\Downloads\\simple.json'

# Read the JSON file
pd.read_json('C:\\Users\\DELL\\Downloads\\simple.json')

       name  age grade
0     Andew   12     A
1    Bhuvan   18     B
2   Clinton   11     A
3     Drake   12     C
4     Eisha   13     B
5    Farhan   22     C
6    Garima   11     A
7  Himanshu   19     A
8    Ishaan   10     D
9     Jason    9     B

In [6]:
gf=pd.read_excel('f1.xlsx')
gf.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,sunil kumar,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,1,rent,78989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,2,Electricity,34,NaN,NaN,5000,NaN,NaN,NaN,sunil kumar,NaN
4,NaN,3,water,44,NaN,NaN,4000,NaN,NaN,1,rent,78989

In [9]:
gf.isnull().sum()

Unnamed: 0     24
Unnamed: 1     22
Unnamed: 2     20
Unnamed: 3     11
Unnamed: 4     26
Unnamed: 5     21
Unnamed: 6     10
Unnamed: 7     26
Unnamed: 8     26
Unnamed: 9     29
Unnamed: 10    24
Unnamed: 11    25
dtype: int64